<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>G18C</title>
</head>
<body>
	<h1>G18C</h1>
	<img src="https://w.namu.la/s/6dbc0ea43112faddeb15e0d294d39376263294b434cae74dfb6004cf4ba7c432c7b472f7fccbc466f52cdbd225b574a50f91328cb95123a52a162c44851f84cf5ed0fddfc990749905bb4718960f299166fb058970897bfd73c9d104ef083ffa">
	<br>
	글록 17에 연사기능을 부가한 모델이다. <br>
	오스트리아의 대테러부대 EKO cobra의 요청에 의해 개발되었다. 슬라이드 후방 측면에 단발 연발 셀렉터가 있다. 연발을 제외한 스펙은 글록 17과 비슷하지만, 연사기능을 넣는 부분때문에 글록 17과 슬라이드, 프레임이 호환되지 않는다.<br>
	연사속도는 웬만한 기관단총보다 빠른 분당 1200발 가량. 원래 글록 18에 쓰기 위해 33발 연장탄창(일명 해피스틱)을 개발했는데, 글록 17의 일반탄창도 사용가능하다. 물론 33발 연장탄창은 글록 17이나 글록 19, 글록 26같은 9mm계 글록에도 문제없이 쓸 수 있다.<br>
	재밌게도, 33발 탄창의 대용량이 미국 민간 슈터들에게 호평받아 9mm 글록을 가진 총잡이들은 하나쯤 사다놓고 가지고 노는 일이 많다고 한다. 글록 19나 글록 26은 휴대성을 고려한 컴팩트급 호신용 권총이지만, 해피스틱을 끼우는 순간 주력 전투용급의 화력을 뿜어낸다. <br> 
	경쟁작은 아직 따라잡지 못하는 글록만의 장점이다. 참고로, 한국산 해피스틱이 미국에서 싼 가격으로 제법 나와있는데 가격이 싸서 좋다는 사람 반, 싼 가격 때문에 신뢰성에 의심이 간다는 사람 반으로 호평과 악평을 동시에 듣고 있다.<br>
	직접적인 전투용으로는 조금 꺼려지지만 집에 사다놓고 가지고 노는 용도로는 좋다고 한다.<br>
	<br>
	컴펜세이터 장착을 한 버전은 글록 18C로 칭하는데, 글록 17L처럼 슬라이드 상부까지 뚫은 컴펜세이터가 장착되어있다. 하지만 총의 사이즈 자체는 표준형과 같다.<br>
	민간인에게는 판매되지 않으며 경찰, 대테러부대 등에서 드문드문 사용한다. 기관권총 중에서는 그나마 근래에도 사용되는 형식이지만, 요새 기관권총 자체가 그다지 인기가 없는지라 널리 쓰이는 정도는 아니다.<br>
	오리지널 글록 18 자체가 좀 희귀하다보니, 영화계에서는 글록 17 슬라이드 후방에 장치를 부착한 글록 17 개조형 연발권총을 만들기도 한다. 가끔 민간시장에도 이런 물건이 나돈다.<br>
	<br>
	Magpul에서 개발한 폴딩 PDW인 FMG-9은 글록 18을 사용한다.<br>
	슈팅 게임에는 기관권총이라는 특징 때문에 현실 속에서 많이 쓰이는 17, 19를 제치고 자주 등장한다. 글록 17이나 19가 맡는 반자동 9mm 권총 자리는 대개 다른 화기가 차지하고 있기 때문에, 많고 많은 글록 중에서도 글록 18이 반자동 권총이 아닌 기관권총, 혹은 게임 시스템에 따라 기관단총 비슷한 위치로 나온다.<br>
</body>
</html>